Конфигурация/Documents/РаспределениеАктивовСтраховыхКомпаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РаспределениеАктивовСтраховыхКомпаний</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтоимостьАктивовСтраховыхКомпаний</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИгнорироватьНедопокрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недопокрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеИсключенных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АктивыСтраховойКомпании</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Актив</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.АктивыСтраховыхКомпаний</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсключенИзРаспределений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубъектПрочегоАктива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКурса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нераспределено</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезервыПоСтрахованиюЖизни</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезервыПоСтрахованиюИномуЧемЖизни</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СобственныеСредстваВРазмереНорматива</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СобственныеСредстваСверхНорматива</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/ЗначенияДополнительныхСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхСведений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПереводовДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ДенежныеСредстваВКредитныхИнструментах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваВКредитныхИнструментах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКредитногоИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКредитныхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКредитногоИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКредитныхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтоимостьАктивовСтраховыхКомпаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтоимостьАктивовСтраховыхКомпаний</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектПрочегоАктива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АктивыСтраховыхКомпаний</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправленияИсходный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ПредоставляемыеПоказателиСтраховыхКомпаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПредоставляемыеПоказателиСтраховыхКомпаний</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПоказателейСтраховыхКомпаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccountingRegisters/ЕдиныйБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccountingRegister>
		<Properties>
			<Name>ЕдиныйБухгалтерскийУчет</Name>
			<ChartOfAccounts>ChartOfAccounts.Единый</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОпераций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаДт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Конфигурация/Documents/РаспределениеАктивовСтраховыхКомпаний/Ext/ObjectModule.bsl
Функция ПолучитьПортфелиСтраховойКомпании(ПортфельДляНераспределенныхАктивов) Экспорт

	ПорфтелиСтраховойКомпании = Новый Структура("Нераспределено", ПортфельДляНераспределенныхАктивов);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияДополнительныхСведений.Объект,
		|	ЗначенияДополнительныхСведений.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|ГДЕ
		|	ЗначенияДополнительныхСведений.Свойство.Ключ = ""СчетаДоверительногоУправления.КонтрольСтраховыхКомпаний.ВидПортфеляСтраховойКомпании""
		|	И ВЫРАЗИТЬ(ЗначенияДополнительныхСведений.Объект КАК Справочник.СчетаДоверительногоУправления).Родитель = &Родитель";
		
	Запрос.УстановитьПараметр("Родитель", ПортфельДляНераспределенныхАктивов.Родитель);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.Значение =  Перечисления.ВидыПортфелейСтраховыхКомпаний.ПортфельВДоверительномУправлении тогда		
				ПорфтелиСтраховойКомпании.Вставить(РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(Выборка.Значение), Выборка.Объект);
		КонецЕсли;
	КонецЦикла;
	        
	Для каждого ОбъектМД Из Метаданные.Перечисления.ВидыПортфелейСтраховыхКомпаний.ЗначенияПеречисления Цикл
		Если Не ПорфтелиСтраховойКомпании.Свойство(ОбъектМД.Имя) И Не ОбъектМД =Метаданные.Перечисления.ВидыПортфелейСтраховыхКомпаний.ЗначенияПеречисления.ПортфельВДоверительномУправлении  Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось найти портфель страховой компании по виду '" + ОбъектМД.Представление() + "'");
		КонецЕсли;
	КонецЦикла;    
	
	Возврат ПорфтелиСтраховойКомпании;

КонецФункции // ПолучитьПортфелиСтраховойКомпании

Процедура УстановитьБлокировки()

	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;	
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиДенежныхСредств");
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация", 					ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);

	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах");
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  	ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);

	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиЦенныхБумаг");
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  	ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);

	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиПрочихАктивов");
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  	ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.СтоимостьАктивовСтраховыхКомпаний");
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  	ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки

////////////////////////////////////////////////////////////////////////////////

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	ЭтотОбъект.Дата=ОбъектКопирования.Дата;


КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта	
	ТекущаяДатаДокумента = ЭтотОбъект.Дата; // для распределения активов важно время распределения, нельзя его сбрасывать в 19:00, пользователи сходят с ума.
	
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	ЭтотОбъект.Дата = ТекущаяДатаДокумента;

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	ЗапретСверхНормативныхСредств = ДействуютПравилаКонтроля710П();
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда // блокирующие проверки
		
		// отрицательных сумм быть не должно
		Для каждого СтрокаАктивыСтраховойКомпании Из ЭтотОбъект.АктивыСтраховойКомпании Цикл
			
			Если СтрокаАктивыСтраховойКомпании.Нераспределено < 0 Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отрицательная нераспределенная сумма актива '" + СтрокаАктивыСтраховойКомпании.Актив + "'",,,, Отказ);
				
			ИначеЕсли СтрокаАктивыСтраховойКомпании.РезервыПоСтрахованиюЖизни < 0
				Или СтрокаАктивыСтраховойКомпании.РезервыПоСтрахованиюИномуЧемЖизни < 0
				Или СтрокаАктивыСтраховойКомпании.СобственныеСредстваВРазмереНорматива < 0
				Или СтрокаАктивыСтраховойКомпании.СобственныеСредстваСверхНорматива < 0
			Тогда
			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отрицательная распределенная сумма актива '" + СтрокаАктивыСтраховойКомпании.Актив + "'",,,, Отказ);
				
			КонецЕсли;
			
			Если СтрокаАктивыСтраховойКомпании.СобственныеСредстваСверхНорматива > 0 И ЗапретСверхНормативныхСредств Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для контроля по правилам 710-П нельзя инвестировать в активы собственные средства сверх норматива. '" + СтрокаАктивыСтраховойКомпании.Актив + "'",,,, Отказ);
			
				
			КонецЕсли;
			
		КонецЦикла;		
		
		Период =  ЭтотОбъект.Дата;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АктивыСтраховойКомпанииВДокументе.Актив КАК Актив,
	|	АктивыСтраховойКомпанииВДокументе.Валюта КАК Валюта,
	|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	АктивыСтраховойКомпанииВДокументе.РезервыПоСтрахованиюЖизни КАК РезервыПоСтрахованиюЖизни,
	|	АктивыСтраховойКомпанииВДокументе.РезервыПоСтрахованиюИномуЧемЖизни КАК РезервыПоСтрахованиюИномуЧемЖизни,
	|	АктивыСтраховойКомпанииВДокументе.СобственныеСредстваВРазмереНорматива КАК СобственныеСредстваВРазмереНорматива,
	|	АктивыСтраховойКомпанииВДокументе.СобственныеСредстваСверхНорматива КАК СобственныеСредстваСверхНорматива,
	|	АктивыСтраховойКомпанииВДокументе.Нераспределено КАК Нераспределено
	|ПОМЕСТИТЬ _АктивыСтраховойКомпанииВДокументе
	|ИЗ
	|	&АктивыСтраховойКомпанииВДокументе КАК АктивыСтраховойКомпанииВДокументе
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_АктивыСтраховойКомпанииВДокументе.Актив КАК Актив,
	|	_АктивыСтраховойКомпанииВДокументе.Валюта КАК Валюта,
	|	_АктивыСтраховойКомпанииВДокументе.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_АктивыСтраховойКомпанииВДокументе.РезервыПоСтрахованиюЖизни КАК РезервыПоСтрахованиюЖизни,
	|	_АктивыСтраховойКомпанииВДокументе.РезервыПоСтрахованиюИномуЧемЖизни КАК РезервыПоСтрахованиюИномуЧемЖизни,
	|	_АктивыСтраховойКомпанииВДокументе.СобственныеСредстваВРазмереНорматива КАК СобственныеСредстваВРазмереНорматива,
	|	_АктивыСтраховойКомпанииВДокументе.СобственныеСредстваСверхНорматива КАК СобственныеСредстваСверхНорматива,
	|	_АктивыСтраховойКомпанииВДокументе.Нераспределено КАК Нераспределено
	|ПОМЕСТИТЬ _ВсеРаспределенныеАктивыСтраховойКомпании
	|ИЗ
	|	_АктивыСтраховойКомпанииВДокументе КАК _АктивыСтраховойКомпанииВДокументе
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.Актив,
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.Валюта,
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.Ссылка.СчетДоверительногоУправления,
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.РезервыПоСтрахованиюЖизни,
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.РезервыПоСтрахованиюИномуЧемЖизни,
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.СобственныеСредстваВРазмереНорматива,
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.СобственныеСредстваСверхНорматива,
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.Нераспределено
	|ИЗ
	|	Документ.РаспределениеАктивовСтраховыхКомпаний.АктивыСтраховойКомпании КАК РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании
	|ГДЕ
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.Ссылка.Проведен = ИСТИНА
	|	И РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.Ссылка.СчетДоверительногоУправления.Родитель = ВЫРАЗИТЬ(&СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления).Родитель
	|	И РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.Ссылка.СчетДоверительногоУправления <> &СчетДоверительногоУправления
	|	И КОНЕЦПЕРИОДА(РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.Ссылка.Дата, ДЕНЬ) = КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ВсеРаспределенныеАктивыСтраховойКомпании.Актив КАК Актив,
	|	_ВсеРаспределенныеАктивыСтраховойКомпании.Валюта КАК Валюта,
	|	_ВсеРаспределенныеАктивыСтраховойКомпании.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ЕСТЬNULL(_ВсеРаспределенныеАктивыСтраховойКомпании.РезервыПоСтрахованиюЖизни, 0) КАК РезервыПоСтрахованиюЖизни,
	|	ЕСТЬNULL(_ВсеРаспределенныеАктивыСтраховойКомпании.РезервыПоСтрахованиюИномуЧемЖизни, 0) КАК РезервыПоСтрахованиюИномуЧемЖизни,
	|	ЕСТЬNULL(_ВсеРаспределенныеАктивыСтраховойКомпании.СобственныеСредстваВРазмереНорматива, 0) КАК СобственныеСредстваВРазмереНорматива,
	|	ЕСТЬNULL(_ВсеРаспределенныеАктивыСтраховойКомпании.СобственныеСредстваСверхНорматива, 0) КАК СобственныеСредстваСверхНорматива,
	|	ЕСТЬNULL(_ВсеРаспределенныеАктивыСтраховойКомпании.Нераспределено, 0) КАК Нераспределено
	|ИЗ
	|	_ВсеРаспределенныеАктивыСтраховойКомпании КАК _ВсеРаспределенныеАктивыСтраховойКомпании
	|ГДЕ
	|	ЕСТЬNULL(_ВсеРаспределенныеАктивыСтраховойКомпании.РезервыПоСтрахованиюЖизни, 0) + ЕСТЬNULL(_ВсеРаспределенныеАктивыСтраховойКомпании.РезервыПоСтрахованиюИномуЧемЖизни, 0) + ЕСТЬNULL(_ВсеРаспределенныеАктивыСтраховойКомпании.СобственныеСредстваВРазмереНорматива, 0) + ЕСТЬNULL(_ВсеРаспределенныеАктивыСтраховойКомпании.СобственныеСредстваСверхНорматива, 0) + ЕСТЬNULL(_ВсеРаспределенныеАктивыСтраховойКомпании.Нераспределено, 0) > 0";
	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления); 
	Запрос.УстановитьПараметр("АктивыСтраховойКомпанииВДокументе", ЭтотОбъект.АктивыСтраховойКомпании.Выгрузить());	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);	
	Запрос.УстановитьПараметр("Период", Период);	    	

	ВсеРаспределенныеАктивыСтраховойКомпании = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВсеРаспределенныеАктивыСтраховойКомпании.Актив КАК Актив,
	|	ВсеРаспределенныеАктивыСтраховойКомпании.Валюта КАК Валюта,
	|	ВсеРаспределенныеАктивыСтраховойКомпании.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|ПОМЕСТИТЬ _АктивыСтраховойКомпании
	|ИЗ
	|	&ВсеРаспределенныеАктивыСтраховойКомпании КАК ВсеРаспределенныеАктивыСтраховойКомпании
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	_АктивыСтраховойКомпании.Актив КАК Актив,
	|	_АктивыСтраховойКомпании.Валюта КАК Валюта,
	|	_АктивыСтраховойКомпании.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|ИЗ
	|	_АктивыСтраховойКомпании КАК _АктивыСтраховойКомпании
	|ГДЕ
	|	_АктивыСтраховойКомпании.Валюта <> ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).ВалютаУчета";
	
	Запрос.УстановитьПараметр("ВсеРаспределенныеАктивыСтраховойКомпании", ВсеРаспределенныеАктивыСтраховойКомпании);	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);	
	ВсеВалютныеАктивы = Запрос.Выполнить().Выгрузить();  	
	
	КурсыВалютАктивовСтраховойКомпании =  Документы.РаспределениеАктивовСтраховыхКомпаний.ПолучитьКурсыВалютДляАктивовСтраховойКомпании(
			ВсеВалютныеАктивы, Период, ЭтотОбъект.Организация);
			                                                     		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.Актив КАК Актив,
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.Валюта КАК Валюта,
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.РезервыПоСтрахованиюЖизни КАК РезервыПоСтрахованиюЖизни,
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.РезервыПоСтрахованиюИномуЧемЖизни КАК РезервыПоСтрахованиюИномуЧемЖизни,
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.СобственныеСредстваВРазмереНорматива КАК СобственныеСредстваВРазмереНорматива,
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.СобственныеСредстваСверхНорматива КАК СобственныеСредстваСверхНорматива,
	|	РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании.Нераспределено КАК Нераспределено
	|ПОМЕСТИТЬ _РаспределенныеАктивыСтраховойКомпании
	|ИЗ
	|	&ВсеРаспределенныеАктивыСтраховойКомпании КАК РаспределениеАктивовСтраховыхКомпанийАктивыСтраховойКомпании
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_КурсыВалютАктивовСтраховойКомпании.Актив КАК Актив,
	|	_КурсыВалютАктивовСтраховойКомпании.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_КурсыВалютАктивовСтраховойКомпании.Валюта КАК Валюта,
	|	_КурсыВалютАктивовСтраховойКомпании.ДатаКурсаВалют КАК ДатаКурсаВалют,
	|	_КурсыВалютАктивовСтраховойКомпании.Курс КАК Курс,
	|	_КурсыВалютАктивовСтраховойКомпании.Кратность КАК Кратность
	|ПОМЕСТИТЬ _КурсыВалютАктивовСтраховойКомпании
	|ИЗ
	|	&КурсыВалютАктивовСтраховойКомпании КАК _КурсыВалютАктивовСтраховойКомпании
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(_РаспределенныеАктивыСтраховойКомпании.Нераспределено * ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1), 0) КАК ЧИСЛО(19, 2))), 0) КАК Нераспределено,
	|	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(_РаспределенныеАктивыСтраховойКомпании.РезервыПоСтрахованиюЖизни * ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1), 0) КАК ЧИСЛО(19, 2))), 0) КАК РезервыПоСтрахованиюЖизни,
	|	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(_РаспределенныеАктивыСтраховойКомпании.РезервыПоСтрахованиюИномуЧемЖизни * ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1), 0) КАК ЧИСЛО(19, 2))), 0) КАК РезервыПоСтрахованиюИномуЧемЖизни,
	|	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(_РаспределенныеАктивыСтраховойКомпании.СобственныеСредстваВРазмереНорматива * ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1), 0) КАК ЧИСЛО(19, 2))), 0) КАК СобственныеСредстваВРазмереНорматива,
	|	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(_РаспределенныеАктивыСтраховойКомпании.СобственныеСредстваСверхНорматива * ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1), 0) КАК ЧИСЛО(19, 2))), 0) КАК СобственныеСредстваСверхНорматива
	|ИЗ
	|	_РаспределенныеАктивыСтраховойКомпании КАК _РаспределенныеАктивыСтраховойКомпании
	|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалютАктивовСтраховойКомпании КАК _КурсыВалютАктивовСтраховойКомпании
	|		ПО _РаспределенныеАктивыСтраховойКомпании.Актив = _КурсыВалютАктивовСтраховойКомпании.Актив
	|			И _РаспределенныеАктивыСтраховойКомпании.СчетДоверительногоУправления = _КурсыВалютАктивовСтраховойКомпании.СчетДоверительногоУправления
	|			И _РаспределенныеАктивыСтраховойКомпании.Валюта = _КурсыВалютАктивовСтраховойКомпании.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПредоставляемыеПоказателиСтраховыхКомпанийСрезПоследних.ВидПоказателя КАК ВидПоказателя,
	|	ПредоставляемыеПоказателиСтраховыхКомпанийСрезПоследних.ЗначениеПоказателя КАК ЗначениеПоказателя
	|ИЗ
	|	РегистрСведений.ПредоставляемыеПоказателиСтраховыхКомпаний.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ПредоставляемыеПоказателиСтраховыхКомпанийСрезПоследних";

		
	
	ВалютаУчета = ЭтотОбъект.Организация.ВалютаУчета;
		
	
	Запрос.УстановитьПараметр("КурсыВалютАктивовСтраховойКомпании", КурсыВалютАктивовСтраховойКомпании);
	Запрос.УстановитьПараметр("ВсеРаспределенныеАктивыСтраховойКомпании", ВсеРаспределенныеАктивыСтраховойКомпании);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	ПакетРезультатов = Запрос.ВыполнитьПакет();

		
		ИтоговыеСуммы = ПакетРезультатов[ПакетРезультатов.Количество() -2].Выгрузить();
		Показатели = ПакетРезультатов[ПакетРезультатов.Количество() -1].Выгрузить();
		
		// Показатель может быть не установлен для СК.		
		ПоказательСРЖ = ?(Показатели.Найти(Перечисления.ВидыПоказателейСтраховыхКомпаний.СтраховыеРезервыПоСтрахованиюЖизни, "ВидПоказателя") = Неопределено, 0,
			Показатели.Найти(Перечисления.ВидыПоказателейСтраховыхКомпаний.СтраховыеРезервыПоСтрахованиюЖизни, "ВидПоказателя").ЗначениеПоказателя);
		ПоказательСРИ = ?(Показатели.Найти(Перечисления.ВидыПоказателейСтраховыхКомпаний.СтраховыеРезервыПоСтрахованиюИномуЧемСтрахованиеЖизни, "ВидПоказателя") = Неопределено, 0,
			Показатели.Найти(Перечисления.ВидыПоказателейСтраховыхКомпаний.СтраховыеРезервыПоСтрахованиюИномуЧемСтрахованиеЖизни, "ВидПоказателя").ЗначениеПоказателя);
		ПоказательССРН = ?(Показатели.Найти(Перечисления.ВидыПоказателейСтраховыхКомпаний.МинимальныйРазмерУставногоКапитала, "ВидПоказателя") = Неопределено, 0, 
			Показатели.Найти(Перечисления.ВидыПоказателейСтраховыхКомпаний.МинимальныйРазмерУставногоКапитала, "ВидПоказателя").ЗначениеПоказателя);
		ПоказательССРН = Макс(ПоказательССРН, 
								?(Показатели.Найти(Перечисления.ВидыПоказателейСтраховыхКомпаний.НормативныйРазмерМаржиПлатежеспособности, "ВидПоказателя") = Неопределено,0,
									Показатели.Найти(Перечисления.ВидыПоказателейСтраховыхКомпаний.НормативныйРазмерМаржиПлатежеспособности, "ВидПоказателя").ЗначениеПоказателя)
							);
		ПоказательСССН = ?(Показатели.Найти(Перечисления.ВидыПоказателейСтраховыхКомпаний.ПревышенияРазмераСобственныхСредствНадНаибольшимПоказателем, "ВидПоказателя") = Неопределено, 0,
			Показатели.Найти(Перечисления.ВидыПоказателейСтраховыхКомпаний.ПревышенияРазмераСобственныхСредствНадНаибольшимПоказателем, "ВидПоказателя").ЗначениеПоказателя);
			
		ОтказСумм=Ложь;
		
		
		Если ИтоговыеСуммы.Количество() > 0 Тогда
			
			ИтоговыеСуммы = ИтоговыеСуммы[0];
			
			Если НЕ ЭтотОбъект.ИгнорироватьНедопокрытие Тогда
					Если ИтоговыеСуммы.РезервыПоСтрахованиюЖизни <> ПоказательСРЖ Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Суммарное значение резервов по страхованию жизни РАСХОДИТСЯ с предоставляемым показателем.",ЭтотОбъект,,, ОтказСумм);
					КонецЕсли;
					Если ИтоговыеСуммы.РезервыПоСтрахованиюИномуЧемЖизни <> ПоказательСРИ Тогда
						 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Суммарное значение резервов по страхованию, иному, чем жизни РАСХОДИТСЯ с предоставляемым показателем.",ЭтотОбъект,,, ОтказСумм); 
					КонецЕсли;
					Если ИтоговыеСуммы.СобственныеСредстваВРазмереНорматива <> ПоказательССРН Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Суммарное значение собственных средств в размере норматива РАСХОДИТСЯ с предоставляемым показателем.",ЭтотОбъект,,, ОтказСумм); 
					КонецЕсли;					
					Если ИтоговыеСуммы.СобственныеСредстваСверхНорматива <> ПоказательСССН и НЕ ЗапретСверхНормативныхСредств Тогда
						 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Суммарное значение собственных средств сверх норматива РАСХОДИТСЯ с предоставляемым показателем.",ЭтотОбъект,,, ОтказСумм); 
					КонецЕсли; 
				Иначе
					Если ИтоговыеСуммы.РезервыПоСтрахованиюЖизни > ПоказательСРЖ Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Суммарное значение резервов по страхованию жизни БОЛЬШЕ, чем предоставляемый показатель.",ЭтотОбъект,,, Отказ);
					КонецЕсли;					
					Если ИтоговыеСуммы.РезервыПоСтрахованиюИномуЧемЖизни > ПоказательСРИ Тогда
						 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Суммарное значение резервов по страхованию, иному, чем жизни БОЛЬШЕ, чем предоставляемый показатель.",ЭтотОбъект,,, Отказ); 
					КонецЕсли;					
					Если ИтоговыеСуммы.СобственныеСредстваВРазмереНорматива > ПоказательССРН Тогда
						 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Суммарное значение собственных средств в размере норматива БОЛЬШЕ, чем предоставляемый показатель.",ЭтотОбъект,,, Отказ);
					КонецЕсли;
					Если ИтоговыеСуммы.СобственныеСредстваСверхНорматива > ПоказательСССН и НЕ ЗапретСверхНормативныхСредств Тогда
						  ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Суммарное значение собственных средств сверх норматива БОЛЬШЕ, чем предоставляемый показатель.",ЭтотОбъект,,, Отказ); 
					КонецЕсли;

			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при попытке расчета суммарных значений резервов или собственных средств. Отправьте скриншот ошибки разработчику.",,,, Отказ);			
		КонецЕсли;

		Если НЕ ЭтотОбъект.ИгнорироватьНедопокрытие Тогда
			Отказ=Отказ Или ОтказСумм;
		КонецЕсли;

		ЭтотОбъект.Недопокрытие=ОтказСумм;

		Для каждого СтрокаАктивовСтраховыхКомпаний Из ЭтотОбъект.АктивыСтраховойКомпании Цикл
			Если СтрокаАктивовСтраховыхКомпаний.ИсключенИзРаспределений И (СтрокаАктивовСтраховыхКомпаний.РезервыПоСтрахованиюЖизни<>0 ИЛИ
				СтрокаАктивовСтраховыхКомпаний.РезервыПоСтрахованиюИномуЧемЖизни<>0 ИЛИ СтрокаАктивовСтраховыхКомпаний.СобственныеСредстваВРазмереНорматива<>0 ИЛИ
				СтрокаАктивовСтраховыхКомпаний.СобственныеСредстваСверхНорматива<>0) Тогда
					ЭтотОбъект.ИспользованиеИсключенных=Истина;
					Прервать;
			КонецЕсли;		
		КонецЦикла;	
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		 ЭтотОбъект.Недопокрытие=Ложь;
		 ЭтотОбъект.ИгнорироватьНедопокрытие=Ложь;
		 ЭтотОбъект.ИспользованиеИсключенных=Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УстановитьБлокировки();
	
	// проверим, что остатки активов совпадают с данными текущего документа
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ЦенныеБумагиСК.Организация КАК Организация,
	|	_ЦенныеБумагиСК.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_ЦенныеБумагиСК.ВидУчета КАК ВидУчета,
	|	_ЦенныеБумагиСК.Рынок КАК Рынок,
	|	_ЦенныеБумагиСК.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_ЦенныеБумагиСК.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
	|	_ЦенныеБумагиСК.ВалютаНоминала КАК ВалютаНоминала,
	|	_ЦенныеБумагиСК.ДатаКурсаВалют КАК ДатаКурсаВалют,
	|	_ЦенныеБумагиСК.Курс КАК Курс,
	|	_ЦенныеБумагиСК.Кратность КАК Кратность,
	|	ЕСТЬNULL(_ЦенныеБумагиСК.БалансоваяСтоимость, 0) + ЕСТЬNULL(_ЦенныеБумагиСК.БалансоваяСтоимостьКупона, 0) КАК БалансоваяСтоимость,
	|	_ЦенныеБумагиСК.БалансоваяСтоимостьКупона КАК БалансоваяСтоимостьКупона,
	|	_ЦенныеБумагиСК.Количество КАК Количество,
	|	_ЦенныеБумагиСК.Стоимость КАК Стоимость,
	|	_ЦенныеБумагиСК.СтоимостьКупона КАК СтоимостьКупона,
	|	_ЦенныеБумагиСК.СтоимостьПокупки КАК СтоимостьПокупки,
	|	_ЦенныеБумагиСК.СтоимостьПокупкиКупона КАК СтоимостьПокупкиКупона,
	|	_ЦенныеБумагиСК.Переоценка КАК Переоценка,
	|	_ЦенныеБумагиСК.ПереоценкаКупона КАК ПереоценкаКупона,
	|	_ЦенныеБумагиСК.ДисконтПремия КАК ДисконтПремия,
	|	_ЦенныеБумагиСК.КорректировкаЭСП КАК КорректировкаЭСП
	|ПОМЕСТИТЬ _СтоимостьЦенныхБумагСтраховойКомпании
	|ИЗ
	|	&СтоимостьЦенныхБумагСтраховойКомпании КАК _ЦенныеБумагиСК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ОстаткиНаДепозитныхВкладах.ДепозитныйВклад КАК ДепозитныйВклад,
	|	_ОстаткиНаДепозитныхВкладах.СуммаДепозитногоВкладаБУ КАК СуммаДепозитногоВкладаБУ,
	|	_ОстаткиНаДепозитныхВкладах.СуммаДепозитногоВкладаВВалютеУчетаБУ КАК СуммаДепозитногоВкладаВВалютеУчетаБУ,
	|	_ОстаткиНаДепозитныхВкладах.НоминалЕПС КАК НоминалЕПС,
	|	_ОстаткиНаДепозитныхВкладах.ПроцентыЕПС КАК ПроцентыЕПС,
	|	_ОстаткиНаДепозитныхВкладах.БалансоваяСтоимостьДепозитногоВклада КАК БалансоваяСтоимостьДепозитногоВклада,
	|	_ОстаткиНаДепозитныхВкладах.ДатаКурсаВалют КАК ДатаКурсаВалют,
	|	_ОстаткиНаДепозитныхВкладах.Курс КАК Курс,
	|	_ОстаткиНаДепозитныхВкладах.Кратность КАК Кратность,
	|	_ОстаткиНаДепозитныхВкладах.Валюта КАК Валюта
	|ПОМЕСТИТЬ _ОстаткиНаДепозитныхВкладахСтраховойКомпании
	|ИЗ
	|	&ОстаткиНаДепозитныхВкладах КАК _ОстаткиНаДепозитныхВкладах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиДенежныхСредствОстатки.РасчетныйСчет КАК Актив,
	|	ОстаткиДенежныхСредствОстатки.Валюта КАК Валюта,
	|	ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК СуммаОстатка,
	|	NULL КАК СубъектПрочегоАктива
	|ПОМЕСТИТЬ _ОстаткиАктивов
	|ИЗ
	|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)) КАК ОстаткиДенежныхСредствОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДенежныхСредствОстатки.Брокер,
	|	ОстаткиДенежныхСредствОстатки.Валюта,
	|	ОстаткиДенежныхСредствОстатки.СуммаОстаток,
	|	NULL
	|ИЗ
	|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)) КАК ОстаткиДенежныхСредствОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_ОстаткиНаДепозитныхВкладахСтраховойКомпании.ДепозитныйВклад,
	|	_ОстаткиНаДепозитныхВкладахСтраховойКомпании.Валюта,
	|	_ОстаткиНаДепозитныхВкладахСтраховойКомпании.БалансоваяСтоимостьДепозитногоВклада,
	|	NULL
	|ИЗ
	|	_ОстаткиНаДепозитныхВкладахСтраховойКомпании КАК _ОстаткиНаДепозитныхВкладахСтраховойКомпании
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиПрочихАктивовОстатки.Актив,
	|	ОстаткиПрочихАктивовОстатки.Валюта,
	|	ВЫБОР
	|		КОГДА ОстаткиПрочихАктивовОстатки.Актив.ВидПрочегоАктива = ЗНАЧЕНИЕ(Справочник.ВидыПрочихАктивов.НедвижимоеИмущество)
	|			ТОГДА ВЫБОР
	|					КОГДА ОценкиСтоимостьИмуществаСрезПоследних.Стоимость ЕСТЬ NULL
	|						ТОГДА ОстаткиПрочихАктивовОстатки.СуммаОстаток
	|					КОГДА ОценкиСтоимостьИмуществаСрезПоследних.Стоимость > 0
	|							И ОценкиСтоимостьИмуществаСрезПоследних.Стоимость < ОстаткиПрочихАктивовОстатки.СуммаОстаток
	|						ТОГДА ОценкиСтоимостьИмуществаСрезПоследних.Стоимость
	|					ИНАЧЕ ОстаткиПрочихАктивовОстатки.СуммаОстаток
	|				КОНЕЦ
	|		ИНАЧЕ ОстаткиПрочихАктивовОстатки.СуммаОстаток
	|	КОНЕЦ,
	|	ОстаткиПрочихАктивовОстатки.Субъект
	|ИЗ
	|	РегистрНакопления.ОстаткиПрочихАктивов.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиПрочихАктивовОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиСтоимостьИмущества.СрезПоследних(&Период, Организация = &Организация) КАК ОценкиСтоимостьИмуществаСрезПоследних
	|		ПО ОстаткиПрочихАктивовОстатки.Актив = ОценкиСтоимостьИмуществаСрезПоследних.Имущество
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_СтоимостьЦенныхБумагСтраховойКомпании.ЦеннаяБумага,
	|	_СтоимостьЦенныхБумагСтраховойКомпании.ВалютаНоминала,
	|	СУММА(_СтоимостьЦенныхБумагСтраховойКомпании.БалансоваяСтоимость),
	|	NULL
	|ИЗ
	|	_СтоимостьЦенныхБумагСтраховойКомпании КАК _СтоимостьЦенныхБумагСтраховойКомпании
	|
	|СГРУППИРОВАТЬ ПО
	|	_СтоимостьЦенныхБумагСтраховойКомпании.Рынок,
	|	_СтоимостьЦенныхБумагСтраховойКомпании.ЦеннаяБумага,
	|	_СтоимостьЦенныхБумагСтраховойКомпании.ВалютаНоминала
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МНО.Ссылка,
	|	МНО.РасчетныйСчет.Валюта,
	|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток,
	|	NULL
	|ИЗ
	|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
	|			&Период,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И Субконто2 ССЫЛКА Документ.МНО) КАК ЕдиныйБухгалтерскийУчетОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МНО КАК МНО
	|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = МНО.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(АктивыСтраховойКомпании.Актив, _ОстаткиАктивов.Актив) КАК Актив,
	|	ЕСТЬNULL(АктивыСтраховойКомпании.СубъектПрочегоАктива, _ОстаткиАктивов.СубъектПрочегоАктива) КАК СубъектПрочегоАктива,
	|	ЕСТЬNULL(АктивыСтраховойКомпании.Валюта, _ОстаткиАктивов.Валюта) КАК Валюта,
	|	ЕСТЬNULL(АктивыСтраховойКомпании.НомерСтроки, 0) КАК НомерСтроки,
	|	ЕСТЬNULL(_ОстаткиАктивов.СуммаОстатка, 0) КАК СуммаОстатка,
	|	ЕСТЬNULL(АктивыСтраховойКомпании.Нераспределено, 0) + ЕСТЬNULL(АктивыСтраховойКомпании.РезервыПоСтрахованиюЖизни, 0) + ЕСТЬNULL(АктивыСтраховойКомпании.РезервыПоСтрахованиюИномуЧемЖизни, 0) + ЕСТЬNULL(АктивыСтраховойКомпании.СобственныеСредстваВРазмереНорматива, 0) + ЕСТЬNULL(АктивыСтраховойКомпании.СобственныеСредстваСверхНорматива, 0) КАК СуммаАктива
	|ИЗ
	|	Документ.РаспределениеАктивовСтраховыхКомпаний.АктивыСтраховойКомпании КАК АктивыСтраховойКомпании
	|		ПОЛНОЕ СОЕДИНЕНИЕ _ОстаткиАктивов КАК _ОстаткиАктивов
	|		ПО АктивыСтраховойКомпании.Актив = _ОстаткиАктивов.Актив
	|			И АктивыСтраховойКомпании.Валюта = _ОстаткиАктивов.Валюта
	|			И (ЕСТЬNULL(АктивыСтраховойКомпании.СубъектПрочегоАктива, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) = ЕСТЬNULL(_ОстаткиАктивов.СубъектПрочегоАктива, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)))
	|ГДЕ
	|	АктивыСтраховойКомпании.Ссылка = &Ссылка
	|	И ЕСТЬNULL(_ОстаткиАктивов.СуммаОстатка, 0) <> ЕСТЬNULL(АктивыСтраховойКомпании.Нераспределено, 0) + ЕСТЬNULL(АктивыСтраховойКомпании.РезервыПоСтрахованиюЖизни, 0) + ЕСТЬNULL(АктивыСтраховойКомпании.РезервыПоСтрахованиюИномуЧемЖизни, 0) + ЕСТЬNULL(АктивыСтраховойКомпании.СобственныеСредстваВРазмереНорматива, 0) + ЕСТЬNULL(АктивыСтраховойКомпании.СобственныеСредстваСверхНорматива, 0)";

	СтоимостьЦенныхБумагСтраховойКомпании = Документы.РаспределениеАктивовСтраховыхКомпаний.ПолучитьСтоимостьЦенныхБумагСтраховойКомпании
					(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Организация,  ЭтотОбъект.МоментВремени().Дата);
					
	ОстаткиНаДепозитныхВкладах = Документы.РаспределениеАктивовСтраховыхКомпаний.ПолучитьСтоимостьДепозитныхВкладовСтраховойКомпании
					(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Организация,  ЭтотОбъект.МоментВремени().Дата);

	Запрос.УстановитьПараметр("СтоимостьЦенныхБумагСтраховойКомпании", СтоимостьЦенныхБумагСтраховойКомпании);	
	Запрос.УстановитьПараметр("ОстаткиНаДепозитныхВкладах", ОстаткиНаДепозитныхВкладах);
	Запрос.УстановитьПараметр("Ссылка",                       ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период",                       ЭтотОбъект.МоментВремени());
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма актива '" + Выборка.Актив + "' " + Выборка.СуммаАктива + " " + Выборка.Валюта + " в документе не совпадает с суммой остатка " + Выборка.СуммаОстатка,,,, Отказ);
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// сформируем таблицу плановых движений
	СтоимостьАктивовСтраховыхКомпанийМД = Метаданные.РегистрыСведений.СтоимостьАктивовСтраховыхКомпаний;
	
	НоваяСтоимостьАктивовСтраховыхКомпаний = Новый ТаблицаЗначений;
	НоваяСтоимостьАктивовСтраховыхКомпаний.Колонки.Добавить("СчетДоверительногоУправления", СтоимостьАктивовСтраховыхКомпанийМД.Измерения.СчетДоверительногоУправления.Тип);
	НоваяСтоимостьАктивовСтраховыхКомпаний.Колонки.Добавить("СубъектПрочегоАктива",         СтоимостьАктивовСтраховыхКомпанийМД.Измерения.СубъектПрочегоАктива.Тип);
	НоваяСтоимостьАктивовСтраховыхКомпаний.Колонки.Добавить("Актив",                        СтоимостьАктивовСтраховыхКомпанийМД.Измерения.Актив.Тип);
	НоваяСтоимостьАктивовСтраховыхКомпаний.Колонки.Добавить("Валюта",                       СтоимостьАктивовСтраховыхКомпанийМД.Измерения.Валюта.Тип);
	НоваяСтоимостьАктивовСтраховыхКомпаний.Колонки.Добавить("Сумма",                        СтоимостьАктивовСтраховыхКомпанийМД.Ресурсы.Сумма.Тип);	
	НоваяСтоимостьАктивовСтраховыхКомпаний.Колонки.Добавить("СчетДоверительногоУправленияИсходный", СтоимостьАктивовСтраховыхКомпанийМД.Измерения.СчетДоверительногоУправленияИсходный.Тип);
		
	ПортфелиСтраховойКомпании = ПолучитьПортфелиСтраховойКомпании(ЭтотОбъект.СчетДоверительногоУправления);
	
	Для каждого СтрокаАктивовСтраховыхКомпаний Из ЭтотОбъект.АктивыСтраховойКомпании Цикл
		
		Для каждого КлючЗнч Из ПортфелиСтраховойКомпании Цикл
			
			Если СтрокаАктивовСтраховыхКомпаний[КлючЗнч.Ключ] <> 0 Тогда
				НоваяСтрокаНоваяСтоимостьАктивовСтраховыхКомпаний = НоваяСтоимостьАктивовСтраховыхКомпаний.Добавить();
				НоваяСтрокаНоваяСтоимостьАктивовСтраховыхКомпаний.СчетДоверительногоУправления = КлючЗнч.Значение;
				НоваяСтрокаНоваяСтоимостьАктивовСтраховыхКомпаний.Актив                        = СтрокаАктивовСтраховыхКомпаний.Актив;
				НоваяСтрокаНоваяСтоимостьАктивовСтраховыхКомпаний.СубъектПрочегоАктива         = СтрокаАктивовСтраховыхКомпаний.СубъектПрочегоАктива;
				НоваяСтрокаНоваяСтоимостьАктивовСтраховыхКомпаний.Валюта                       = СтрокаАктивовСтраховыхКомпаний.Валюта;
				НоваяСтрокаНоваяСтоимостьАктивовСтраховыхКомпаний.Сумма                        = СтрокаАктивовСтраховыхКомпаний[КлючЗнч.Ключ];
				НоваяСтрокаНоваяСтоимостьАктивовСтраховыхКомпаний.СчетДоверительногоУправленияИсходный = ЭтотОбъект.СчетДоверительногоУправления;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	
	
	// запишем новые активы (не забыв обнулить отсутствующие старые)
	Движения.СтоимостьАктивовСтраховыхКомпаний.Записывать = Истина;
	
	Движения.СтоимостьАктивовСтраховыхКомпаний.Очистить();
	Движения.СтоимостьАктивовСтраховыхКомпаний.Записать();		
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоваяСтоимостьАктивовСтраховыхКомпаний.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	НоваяСтоимостьАктивовСтраховыхКомпаний.Актив КАК Актив,
	|	НоваяСтоимостьАктивовСтраховыхКомпаний.СубъектПрочегоАктива КАК СубъектПрочегоАктива,
	|	НоваяСтоимостьАктивовСтраховыхКомпаний.Валюта КАК Валюта,
	|	НоваяСтоимостьАктивовСтраховыхКомпаний.Сумма КАК Сумма
	|ПОМЕСТИТЬ _НоваяСтоимостьАктивовСтраховыхКомпаний
	|ИЗ
	|	&НоваяСтоимостьАктивовСтраховыхКомпаний КАК НоваяСтоимостьАктивовСтраховыхКомпаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ЕСТЬNULL(_НоваяСтоимостьАктивовСтраховыхКомпаний.СчетДоверительногоУправления, СтоимостьАктивовСрезПоследних.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
	|	ЕСТЬNULL(_НоваяСтоимостьАктивовСтраховыхКомпаний.Актив, СтоимостьАктивовСрезПоследних.Актив) КАК Актив,
	|	ЕСТЬNULL(_НоваяСтоимостьАктивовСтраховыхКомпаний.СубъектПрочегоАктива, СтоимостьАктивовСрезПоследних.СубъектПрочегоАктива) КАК СубъектПрочегоАктива,
	|	ЕСТЬNULL(_НоваяСтоимостьАктивовСтраховыхКомпаний.Валюта, СтоимостьАктивовСрезПоследних.Валюта) КАК Валюта,
	|	ЕСТЬNULL(_НоваяСтоимостьАктивовСтраховыхКомпаний.Сумма, 0) КАК Сумма,
	|	&СчетДоверительногоУправления КАК СчетДоверительногоУправленияИсходный
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтоимостьАктивовСрезПоследних.Период КАК Период,
	|		СтоимостьАктивовСрезПоследних.Регистратор КАК Регистратор,
	|		СтоимостьАктивовСрезПоследних.НомерСтроки КАК НомерСтроки,
	|		СтоимостьАктивовСрезПоследних.Активность КАК Активность,
	|		СтоимостьАктивовСрезПоследних.Организация КАК Организация,
	|		СтоимостьАктивовСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|		СтоимостьАктивовСрезПоследних.СубъектПрочегоАктива КАК СубъектПрочегоАктива,
	|		СтоимостьАктивовСрезПоследних.Актив КАК Актив,
	|		СтоимостьАктивовСрезПоследних.Валюта КАК Валюта,
	|		СтоимостьАктивовСрезПоследних.Сумма КАК Сумма
	|	ИЗ
	|		РегистрСведений.СтоимостьАктивовСтраховыхКомпаний.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И СчетДоверительногоУправленияИсходный = &СчетДоверительногоУправления
	|					И СчетДоверительногоУправления.Родитель = ВЫРАЗИТЬ(&СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления).Родитель) КАК СтоимостьАктивовСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведенийСрезПоследних
	|			ПО СтоимостьАктивовСрезПоследних.Регистратор.СчетДоверительногоУправления = ЗначенияДополнительныхСведенийСрезПоследних.Объект
	|				И (ЗначенияДополнительныхСведенийСрезПоследних.Свойство.Ключ = ""СчетаДоверительногоУправления.КонтрольСтраховыхКомпаний.ВидПортфеляСтраховойКомпании"")
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведенийДляСчетаДоверительногоУправления
	|			ПО (ЗначенияДополнительныхСведенийДляСчетаДоверительногоУправления.Объект = &СчетДоверительногоУправления)
	|				И (ЗначенияДополнительныхСведенийДляСчетаДоверительногоУправления.Свойство.Ключ = ""СчетаДоверительногоУправления.КонтрольСтраховыхКомпаний.ВидПортфеляСтраховойКомпании"")
	|	ГДЕ
	|		(ЗначенияДополнительныхСведенийСрезПоследних.Объект ЕСТЬ NULL
	|					И ЗначенияДополнительныхСведенийДляСчетаДоверительногоУправления.Объект ЕСТЬ NULL
	|				ИЛИ НЕ ЗначенияДополнительныхСведенийДляСчетаДоверительногоУправления.Объект ЕСТЬ NULL
	|					И ЗначенияДополнительныхСведенийСрезПоследних.Значение = ЗначенияДополнительныхСведенийДляСчетаДоверительногоУправления.Значение)) КАК СтоимостьАктивовСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ _НоваяСтоимостьАктивовСтраховыхКомпаний КАК _НоваяСтоимостьАктивовСтраховыхКомпаний
	|		ПО СтоимостьАктивовСрезПоследних.СчетДоверительногоУправления = _НоваяСтоимостьАктивовСтраховыхКомпаний.СчетДоверительногоУправления
	|			И СтоимостьАктивовСрезПоследних.Актив = _НоваяСтоимостьАктивовСтраховыхКомпаний.Актив
	|			И СтоимостьАктивовСрезПоследних.Валюта = _НоваяСтоимостьАктивовСтраховыхКомпаний.Валюта
	|			И (ЕСТЬNULL(СтоимостьАктивовСрезПоследних.СубъектПрочегоАктива, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) = ЕСТЬNULL(_НоваяСтоимостьАктивовСтраховыхКомпаний.СубъектПрочегоАктива, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)))
	|ГДЕ
	|	(ЕСТЬNULL(_НоваяСтоимостьАктивовСтраховыхКомпаний.Сумма, 0) <> 0
	|			ИЛИ ЕСТЬNULL(СтоимостьАктивовСрезПоследних.Сумма, 0) <> 0)";
		
	Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период",                       ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("НоваяСтоимостьАктивовСтраховыхКомпаний",
		НоваяСтоимостьАктивовСтраховыхКомпаний);
		
	Движения.СтоимостьАктивовСтраховыхКомпаний.Загрузить(
		Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


#region Обработка_Новых_правил_контроля_710П

Функция ДействуютПравилаКонтроля710П() Экспорт
	
	 ДатаДействияПравил = ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(
		, "ДатаНачалаКонтроляСтраховыхКомпанийПоПравилам710П", СчетДоверительногоУправления);  
		
		Если ДатаДействияПравил <> Неопределено Тогда
			
			возврат Дата >= ДатаДействияПравил;
			
		КонецЕсли;
		
		возврат Ложь;  	
	
КонецФункции

#endregion
